# L_06: Pandas Group By

Learn how to use `groupby()` to analyze and aggregate data effectively.

In [ ]:
import pandas as pd

# Sample dataset
data = {
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT', 'IT'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Salary': [50000, 60000, 45000, 47000, 70000, 72000],
    'Years': [2, 3, 1, 4, 5, 3]
}
df = pd.DataFrame(data)
df

Grouping by Department

In [ ]:
# Average salary per department
df.groupby('Department')['Salary'].mean()

# Average salary per department

In [ ]:
# Apply multiple aggregation functions
df.groupby('Department').agg({
    'Salary': ['mean', 'max', 'min'],
    'Years': 'sum'
})

### Filtering after groupby

In [ ]:
# Total salary per department and filtering departments with total salary > 100000
salary_totals = df.groupby('Department')['Salary'].sum()
salary_totals[salary_totals > 100000]

### Resetting index

In [ ]:
# Resetting index after groupby
avg_salary = df.groupby('Department')['Salary'].mean().reset_index()
avg_salary

# L_06: Pandas Group By

Learn how to use `groupby()` to analyze and aggregate data effectively.

In [1]:
import pandas as pd

# Sample dataset
data = {
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT', 'IT'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Salary': [50000, 60000, 45000, 47000, 70000, 72000],
    'Years': [2, 3, 1, 4, 5, 3]
}
df = pd.DataFrame(data)
df

  Department Employee  Salary  Years
0      Sales    Alice   50000      2
1      Sales      Bob   60000      3
2         HR  Charlie   45000      1
3         HR    David   47000      4
4         IT      Eve   70000      5
5         IT    Frank   72000      3

Grouping by Department

In [2]:
# Average salary per department
df.groupby('Department')['Salary'].mean()

Department
HR       46000.0
IT       71000.0
Sales    55000.0
Name: Salary, dtype: float64

# Average salary per department

In [3]:
# Apply multiple aggregation functions
df.groupby('Department').agg({
    'Salary': ['mean', 'max', 'min'],
    'Years': 'sum'
})

             Salary               Years
               mean    max    min   sum
Department
HR          46000.0  47000  45000     5
IT          71000.0  72000  70000     8
Sales       55000.0  60000  50000     5

### Filtering after groupby

In [4]:
# Total salary per department and filtering departments with total salary > 100000
salary_totals = df.groupby('Department')['Salary'].sum()
salary_totals[salary_totals > 100000]

Department
IT       142000
Sales    110000
Name: Salary, dtype: int64

### Resetting index

In [5]:
# Resetting index after groupby
avg_salary = df.groupby('Department')['Salary'].mean().reset_index()
avg_salary

  Department   Salary
0         HR  46000.0
1         IT  71000.0
2      Sales  55000.0